In [5]:
data_records = {
    "Names": [
        "Amenda", "Bob", "Christene", "Charlie", "John", "Sarah", "David", 
        "Emily", "Michael", "Jessica", "Daniel", "Laura", "Chris", "Anna", 
        "Ryan", "Johnson", "Maria", "Steven", "Nicole", "Kevin", "Olivia",
        "Mark", "Lisa", "Sam", "Jennifer"
    ],
    "Age": [
        26, 30, 32, 36, 40, 29, 45, 23, 51, 38, 25, 33, 41, 27, 35, 37, 28, 55, 31, 24, 42, 39, 22, 48, 34
    ],
    "JobRole": [
        "High School Teacher", "Financial Analyst", "Private Chef", "Construction Manager", "School Bus Driver", 
        "Software Engineer", "Marketing Director", "Graphic Designer", "Senior Accountant", "Registered Nurse", 
        "Data Analyst", "HR Specialist", "Electrician", "Veterinarian", "Sales Representative", "Real Estate Agent",
        "UX Designer", "VP of Operations", "Biomedical Engineer", "Retail Associate", "Librarian", 
        "Attorney", "Social Worker", "Journalist", "Project Manager"
    ],
    "Salary": [
        42000, 68000, 72000, 75000, 46000, 110000, 135000, 55000, 89000, 78000, 
        125000, 62000, 65000, 95000, 80000, 92000, 105000, 210000, 85000, 35000, 58000, 
        150000, 48000, 70000, 98000
    ],
    "SecondJob": [
        "Influencer", None, None, "Bartender", "Uber Driver", "Freelance Coder", None, 
        "Etsy Shop Owner", None, "Part-time Tutor", None, None, None, "Pet Sitter", 
        "Real Estate Agent", None, "Online Course Creator", None, None, "Delivery Driver", 
        None, "Pro-bono Consultant", None, "Blogger", "Virtual Assistant"
    ],
    "SecondaryIncome": [
        25000, None, None, 18000, 15000, 30000, None, 12000, None, 10000, 
        None, None, None, 5000, 45000, None, 15000, None, None, 8000, 
        None, 20000, None, 10000, 5000
    ],
    "Gender": [
        'F', 'M', 'F', 'M', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'M',
        'F', 'M', 'F', 'M', 'F', 'M', 'F', 'M', 'F'
    ],
    "YearsExperience": [
        3, 7, 5, 12, 15, 6, 20, 1, 25, 10, 2, 8, 18, 4, 11, 12, 5, 30, 9, 1, 19, 14, 2, 17, 7
    ],
    "City": [
        "Austin, TX", "London, UK", "Paris, FR", "New York, NY", "Chicago, IL", 
        "Seattle, WA", "Boston, MA", "Los Angeles, CA", "Miami, FL", "Toronto, ON", 
        "San Francisco, CA", "Dallas, TX", "Houston, TX", "Philadelphia, PA", "Denver, CO", 
        "New York, NY", "Chicago, IL", "Boston, MA", "Seattle, WA", "Miami, FL", 
        "Dallas, TX", "Austin, TX", "Los Angeles, CA", "London, UK", "Houston, TX"
    ],
    "EducationLevel": [
        "Bachelor's", "Master's", "Associate's", "High School", "High School", 
        "Master's", "Bachelor's", "Bachelor's", "Master's", "Bachelor's", 
        "PhD", "Master's", "Associate's", "Doctorate", "Bachelor's", 
        "Bachelor's", "Master's", "Master's", "PhD", "High School",
        "Master's", "Doctorate", "Bachelor's", "Bachelor's", "Master's"
    ]
}

In [3]:
import pandas as pd

In [6]:
df = pd.DataFrame(data_records)

In [7]:
df.head(5)

,Names,Age,JobRole,Salary,SecondJob,SecondaryIncome,Gender,YearsExperience,City,EducationLevel
0,Amenda,26,High School Teacher,42000,Influencer,25000.0,F,3,"Austin, TX",Bachelor's
1,Bob,30,Financial Analyst,68000,None,NaN,M,7,"London, UK",Master's
2,Christene,32,Private Chef,72000,None,NaN,F,5,"Paris, FR",Associate's
3,Charlie,36,Construction Manager,75000,Bartender,18000.0,M,12,"New York, NY",High School
4,John,40,School Bus Driver,46000,Uber Driver,15000.0,M,15,"Chicago, IL",High School

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25 entries, 0 to 24
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Names            25 non-null     object
 1   Age              25 non-null     int64
 2   JobRole          25 non-null     object
 3   Salary           25 non-null     int64
 4   SecondJob        13 non-null     object
 5   SecondaryIncome  13 non-null     float64
 6   Gender           25 non-null     object
 7   YearsExperience  25 non-null     int64
 8   City             25 non-null     object
 9   EducationLevel   25 non-null     object
dtypes: float64(1), int64(3), object(6)
memory usage: 1.4+ KB

In [9]:
df["Salary"] = df["Salary"].fillna(0)
df["SecondaryIncome"] = df["SecondaryIncome"].fillna(0)

df["TotalIncome"] = df["Salary"] + df["SecondaryIncome"]

In [10]:
df.head(5)

,Names,Age,JobRole,Salary,SecondJob,SecondaryIncome,Gender,YearsExperience,City,EducationLevel,TotalIncome
0,Amenda,26,High School Teacher,42000,Influencer,25000.0,F,3,"Austin, TX",Bachelor's,67000.0
1,Bob,30,Financial Analyst,68000,None,0.0,M,7,"London, UK",Master's,68000.0
2,Christene,32,Private Chef,72000,None,0.0,F,5,"Paris, FR",Associate's,72000.0
3,Charlie,36,Construction Manager,75000,Bartender,18000.0,M,12,"New York, NY",High School,93000.0
4,John,40,School Bus Driver,46000,Uber Driver,15000.0,M,15,"Chicago, IL",High School,61000.0

In [11]:
round(df.describe())

        Age    Salary  SecondaryIncome  YearsExperience  TotalIncome
count  25.0      25.0             25.0             25.0         25.0
mean   35.0   85920.0           8720.0             11.0      94640.0
std     9.0   38699.0          11692.0              8.0      39614.0
min    22.0   35000.0              0.0              1.0      43000.0
25%    28.0   62000.0              0.0              5.0      67000.0
50%    34.0   78000.0           5000.0              9.0      88000.0
75%    40.0   98000.0          15000.0             15.0     120000.0
max    55.0  210000.0          45000.0             30.0     210000.0

In [12]:
male_records_df = df[df["Gender"] == 'M'].copy()

In [13]:
female_records_df = df[df["Gender"] == 'F'].copy()

In [14]:
print(f"No. of Male Workers: {male_records_df.shape[0]}")
print(f"No. of Male Workers having Second Job: {male_records_df["SecondJob"].notna().sum()}")
print(f"Mean Income of Male Workers: ${round(male_records_df["TotalIncome"].mean(), 2)}")
print(f"Median Income of Male Workers: ${round(male_records_df["TotalIncome"].median(), 2)}")
print(f"Average Yrs of Experience: {round(male_records_df["YearsExperience"].mean(), 1)}")

No. of Male Workers: 13
No. of Male Workers having Second Job: 6
Mean Income of Male Workers: $104307.69
Median Income of Male Workers: $92000.0
Average Yrs of Experience: 14.2

In [15]:
print(f"No. of Female Workers: {female_records_df.shape[0]}")
print(f"No. of Female Workers having Second Job: {female_records_df["SecondJob"].notna().sum()}")
print(f"Mean Income of Female Workers: ${round(female_records_df["TotalIncome"].mean(), 2)}")
print(f"Median Income of Female Workers: ${round(female_records_df["TotalIncome"].median(), 2)}")
print(f"Average Yrs of Experience: {round(female_records_df["YearsExperience"].mean(), 1)}")

No. of Female Workers: 12
No. of Female Workers having Second Job: 7
Mean Income of Female Workers: $84166.67
Median Income of Female Workers: $78500.0
Average Yrs of Experience: 6.6

In [16]:
df.sort_values(by="TotalIncome", ascending=False, inplace=True)

In [17]:
df.head(3)

,Names,Age,JobRole,Salary,SecondJob,SecondaryIncome,Gender,YearsExperience,City,EducationLevel,TotalIncome
17,Steven,55,VP of Operations,210000,None,0.0,M,30,"Boston, MA",Master's,210000.0
21,Mark,39,Attorney,150000,Pro-bono Consultant,20000.0,M,14,"Austin, TX",Doctorate,170000.0
5,Sarah,29,Software Engineer,110000,Freelance Coder,30000.0,F,6,"Seattle, WA",Master's,140000.0

In [18]:
print(round(df.groupby(by="EducationLevel")["TotalIncome"].mean().sort_values(ascending=False)))

EducationLevel
Doctorate      135000.0
Master's       106250.0
PhD            105000.0
Bachelor's      87750.0
Associate's     68500.0
High School     65667.0
Name: TotalIncome, dtype: float64

In [19]:
entry_level_workers = df[(df["Age"] <= 25) | (df["YearsExperience"] <= 2)].copy()

In [20]:
entry_level_workers["JobRole"]

10        Data Analyst
7     Graphic Designer
22       Social Worker
19    Retail Associate
Name: JobRole, dtype: object